zhangmeng5337/Hardware/stc/code/tm7780/stc8h1K.h
#ifndef __STC8H_H__
#define __STC8H_H__
#include "stc8h1k.h"
#include "intrins.h"
#include "string.h"
#include "stdio.h"
//#include "stdbool"
/////////////////////////////////////////////////
#define u1      bool
#define u8	unsigned char
#define u16	unsigned int
#define u32	unsigned long

#define TRUE 1

//包含本头文件后,不用另外再包含"REG51.H"

sfr         P0          =           0x80;
sbit    P00         =           P0 ^ 0;
sbit    P01         =           P0 ^ 1;
sbit    P02         =           P0 ^ 2;
sbit    P03         =           P0 ^ 3;
sbit    P04         =           P0 ^ 4;
sbit    P05         =           P0 ^ 5;
sbit    P06         =           P0 ^ 6;
sbit    P07         =           P0 ^ 7;

sfr         SP          =           0x81;
sfr         DPL         =           0x82;
sfr         DPH         =           0x83;
sfr         S4CON       =           0x84;
sfr         S4BUF       =           0x85;
sfr         PCON        =           0x87;

sfr         TCON        =           0x88;
sbit    TF1         =           TCON ^ 7;
sbit    TR1         =           TCON ^ 6;
sbit    TF0         =           TCON ^ 5;
sbit    TR0         =           TCON ^ 4;
sbit    IE1         =           TCON ^ 3;
sbit    IT1         =           TCON ^ 2;
sbit    IE0         =           TCON ^ 1;
sbit    IT0         =           TCON ^ 0;

sfr         TMOD        =           0x89;
sfr         TL0         =           0x8a;
sfr         TL1         =           0x8b;
sfr         TH0         =           0x8c;
sfr         TH1         =           0x8d;
sfr         AUXR        =           0x8e;
sfr         INTCLKO     =           0x8f;

sfr         P1          =           0x90;
sbit    P10         =           P1 ^ 0;
sbit    P11         =           P1 ^ 1;
sbit    P12         =           P1 ^ 2;
sbit    P13         =           P1 ^ 3;
sbit    P14         =           P1 ^ 4;
sbit    P15         =           P1 ^ 5;
sbit    P16         =           P1 ^ 6;
sbit    P17         =           P1 ^ 7;

sfr         P1M1        =           0x91;
sfr         P1M0        =           0x92;
sfr         P0M1        =           0x93;
sfr         P0M0        =           0x94;
sfr         P2M1        =           0x95;
sfr         P2M0        =           0x96;

sfr         SCON        =           0x98;
sbit    SM0         =           SCON ^ 7;
sbit    SM1         =           SCON ^ 6;
sbit    SM2         =           SCON ^ 5;
sbit    REN         =           SCON ^ 4;
sbit    TB8         =           SCON ^ 3;
sbit    RB8         =           SCON ^ 2;
sbit    TI          =           SCON ^ 1;
sbit    RI          =           SCON ^ 0;

sfr         SBUF        =           0x99;
sfr         S2CON       =           0x9a;
sfr         S2BUF       =           0x9b;
sfr         IRCBAND     =           0x9d;
sfr         LIRTRIM     =           0x9e;
sfr         IRTRIM      =           0x9f;

sfr         P2          =           0xa0;
sbit    P20         =           P2 ^ 0;
sbit    P21         =           P2 ^ 1;
sbit    P22         =           P2 ^ 2;
sbit    P23         =           P2 ^ 3;
sbit    P24         =           P2 ^ 4;
sbit    P25         =           P2 ^ 5;
sbit    P26         =           P2 ^ 6;
sbit    P27         =           P2 ^ 7;

sfr         P_SW1       =           0xa2;

sfr         IE          =           0xa8;
sbit    EA          =           IE ^ 7;
sbit    ELVD        =           IE ^ 6;
sbit    EADC        =           IE ^ 5;
sbit    ES          =           IE ^ 4;
sbit    ET1         =           IE ^ 3;
sbit    EX1         =           IE ^ 2;
sbit    ET0         =           IE ^ 1;
sbit    EX0         =           IE ^ 0;

sfr         SADDR       =           0xa9;
sfr         WKTCL       =           0xaa;
sfr         WKTCH       =           0xab;
sfr         S3CON       =           0xac;
sfr         S3BUF       =           0xad;
sfr         TA          =           0xae;
sfr         IE2         =           0xaf;

sfr         P3          =           0xb0;
sbit    P30         =           P3 ^ 0;
sbit    P31         =           P3 ^ 1;
sbit    P32         =           P3 ^ 2;
sbit    P33         =           P3 ^ 3;
sbit    P34         =           P3 ^ 4;
sbit    P35         =           P3 ^ 5;
sbit    P36         =           P3 ^ 6;
sbit    P37         =           P3 ^ 7;

sbit    RD          =           P3 ^ 7;
sbit    WR          =           P3 ^ 6;
sbit    T1          =           P3 ^ 5;
sbit    T0          =           P3 ^ 4;
sbit    INT1        =           P3 ^ 3;
sbit    INT0        =           P3 ^ 2;
sbit    TXD         =           P3 ^ 1;
sbit    RXD         =           P3 ^ 0;

sfr         P3M1        =           0xb1;
sfr         P3M0        =           0xb2;
sfr         P4M1        =           0xb3;
sfr         P4M0        =           0xb4;
sfr         IP2         =           0xb5;
sfr         IP2H        =           0xb6;
sfr         IPH         =           0xb7;

sfr         IP          =           0xb8;
sbit    PPCA        =           IP ^ 7;
sbit    PLVD        =           IP ^ 6;
sbit    PADC        =           IP ^ 5;
sbit    PS          =           IP ^ 4;
sbit    PT1         =           IP ^ 3;
sbit    PX1         =           IP ^ 2;
sbit    PT0         =           IP ^ 1;
sbit    PX0         =           IP ^ 0;

sfr         SADEN       =           0xb9;
sfr         P_SW2       =           0xba;
sfr         ADC_CONTR   =           0xbc;
sfr         ADC_RES     =           0xbd;
sfr         ADC_RESL    =           0xbe;

sfr         P4          =           0xc0;
sbit    P40         =           P4 ^ 0;
sbit    P41         =           P4 ^ 1;
sbit    P42         =           P4 ^ 2;
sbit    P43         =           P4 ^ 3;
sbit    P44         =           P4 ^ 4;
sbit    P45         =           P4 ^ 5;
sbit    P46         =           P4 ^ 6;
sbit    P47         =           P4 ^ 7;

sfr         WDT_CONTR   =           0xc1;
sfr         IAP_DATA    =           0xc2;
sfr         IAP_ADDRH   =           0xc3;
sfr         IAP_ADDRL   =           0xc4;
sfr         IAP_CMD     =           0xc5;
sfr         IAP_TRIG    =           0xc6;
sfr         IAP_CONTR   =           0xc7;

sfr         P5          =           0xc8;
sbit    P50         =           P5 ^ 0;
sbit    P51         =           P5 ^ 1;
sbit    P52         =           P5 ^ 2;
sbit    P53         =           P5 ^ 3;
sbit    P54         =           P5 ^ 4;
sbit    P55         =           P5 ^ 5;
sbit    P56         =           P5 ^ 6;
sbit    P57         =           P5 ^ 7;

sfr         P5M1        =           0xc9;
sfr         P5M0        =           0xca;
sfr         P6M1        =           0xcb;
sfr         P6M0        =           0xcc;
sfr         SPSTAT      =           0xcd;
sfr         SPCTL       =           0xce;
sfr         SPDAT       =           0xcf;

sfr         PSW         =           0xd0;
sbit    CY          =           PSW ^ 7;
sbit    AC          =           PSW ^ 6;
sbit    F0          =           PSW ^ 5;
sbit    RS1         =           PSW ^ 4;
sbit    RS0         =           PSW ^ 3;
sbit    OV          =           PSW ^ 2;
sbit    F1          =           PSW ^ 1;
sbit    P           =           PSW ^ 0;

sfr         T4T3M       =           0xd1;
sfr         T4H         =           0xd2;
sfr         T4L         =           0xd3;
sfr         T3H         =           0xd4;
sfr         T3L         =           0xd5;
sfr         T2H         =           0xd6;
sfr         T2L         =           0xd7;

sfr         T3T4M       =           0xd1;
sfr         TH4         =           0xd2;
sfr         TL4         =           0xd3;
sfr         TH3         =           0xd4;
sfr         TL3         =           0xd5;
sfr         TH2         =           0xd6;
sfr         TL2         =           0xd7;

